app/controllers/authentications_controller.rb

  def register
    user = User.new(Uploader.upload(user_params))
    if user.save
---
INSERT INTO "users" ("username", "email", "image", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"