app/controllers/oauth_controller.rb

SELECT  "users".* FROM "users" WHERE (github_id = 26736851 OR email = NULL) ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "users" ("username", "email", "github_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "alexandriako"], ["email", "[nil]"], ["github_id", 26736851], ["created_at", "2017-07-24 08:32:16.268977"], ["updated_at", "2017-07-24 08:32:16.268977"]]
---
  def github
    token = HTTParty.post('https://github.com/login/oauth/access_token', {
      query: {
        client_id: ENV["GITHUB_CLIENT_ID_MAKE_NEWS"],
        client_secret: ENV["GITHUB_CLIENT_SECRET_MAKE_NEWS"],
        code: params[:code]
      },
      headers: { 'Accept' => 'application/json'}
    }).parsed_response

    profile = HTTParty.get('https://api.github.com/user', {
      query: token,
      headers: { 'User-Agent' => 'HTTParty', 'Accept' => 'application/json' }
    }).parsed_response

    p profile

    user = User.where("github_id = :github_id OR email = :email", email: profile["email"], github_id: profile["id"]).first
    user = User.new username: profile["login"], email: [profile["email"]] unless user
    user[:github_id] = profile["id"]

    p user

    if user.save