app/controllers/posts_controller.rb

INSERT INTO "posts" ("headline", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["headline", "testing final?"], ["description", "testing for reals"], ["user_id", 2], ["created_at", "2017-07-24 10:02:35.023677"], ["updated_at", "2017-07-24 10:02:35.023677"]]
---
  def create
    @post = Post.new(Uploader.upload(post_params))
    @post.user = current_user;

    if @post.save

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 6]]
---
  def destroy
    return render json: { errors: ["Unauthorized"] } if @post.user != current_user
    @post.destroy